In [1]:
%load_ext sql

In [2]:
%sql mysql://root:131313@localhost/sberbank

u'Connected: root@sberbank'

In [4]:
%%sql 
CREATE TABLE Orders (
    ConsumerID int,
    Month date,
    Amount int,
    Count int
);

0 rows affected.

[]

In [7]:
%%sql 
SHOW TABLES

1 rows affected.

[('Orders',)]

In [8]:
%%sql
INSERT INTO Orders VALUES (1, '2013-10-01', 3250, 10),
(1, '2013-04-01', 2000, 4 ),(1, '2013-07-01', 1700, 7),
(2, '2013-02-01', 3700, 8),(3, '2013-01-01', 5000, 10),
(3, '2013-02-01', 6000, 11),(3, '2013-05-01', 7000, 12);

7 rows affected.

[]

In [9]:
%%sql 
SELECT * 
    FROM Orders

7 rows affected.

[(1L, datetime.date(2013, 10, 1), 3250L, 10L),
 (1L, datetime.date(2013, 4, 1), 2000L, 4L),
 (1L, datetime.date(2013, 7, 1), 1700L, 7L),
 (2L, datetime.date(2013, 2, 1), 3700L, 8L),
 (3L, datetime.date(2013, 1, 1), 5000L, 10L),
 (3L, datetime.date(2013, 2, 1), 6000L, 11L),
 (3L, datetime.date(2013, 5, 1), 7000L, 12L)]

### Запрос последний заказ для каждого клиента:

In [10]:
%%sql 
SELECT *
    FROM Orders a
    WHERE Month = 
        ( SELECT MAX(Month)
          FROM Orders b
          WHERE a.ConsumerID = b.ConsumerID
        );

3 rows affected.

[(1L, datetime.date(2013, 10, 1), 3250L, 10L),
 (2L, datetime.date(2013, 2, 1), 3700L, 8L),
 (3L, datetime.date(2013, 5, 1), 7000L, 12L)]

### Запрос выводящий последние два месяца:

In [11]:
%%sql
SELECT *
FROM   Orders a 
WHERE 2>=
        (
            SELECT  COUNT(*) 
            FROM    Orders  b
            WHERE a.ConsumerID = b.ConsumerID AND 
                  b.Month >= a.Month
        );

5 rows affected.

[(1L, datetime.date(2013, 10, 1), 3250L, 10L),
 (1L, datetime.date(2013, 7, 1), 1700L, 7L),
 (2L, datetime.date(2013, 2, 1), 3700L, 8L),
 (3L, datetime.date(2013, 2, 1), 6000L, 11L),
 (3L, datetime.date(2013, 5, 1), 7000L, 12L)]

### Менее элегантный вариант

1. Создается два проедставления Last_month и Without_last_month = (Orders - Last_month)
2. Из представления Without_last_month снова выбираются последние месяцы для каждого покупателя
   и резуьтаты запроса объединяются с Last_month в представление Last_two_month.

In [12]:
%%sql 
CREATE VIEW Last_month
as  SELECT *
    FROM Orders a
    WHERE Month = 
            ( 
              SELECT MAX(Month)
              FROM Orders b
              WHERE a.ConsumerID = b.ConsumerID
            );

0 rows affected.

[]

In [13]:
%%sql 
CREATE VIEW Without_last_month
as
    SELECT a.ConsumerID, a.Month,a.Amount,a.Count
    FROM Orders a 
    LEFT JOIN Last_month b
    ON a.Month = b.Month and a.ConsumerID = b.ConsumerID
    WHERE b.Month is NULL

0 rows affected.

[]

In [14]:
%%sql
SELECT *
FROM Without_last_month

4 rows affected.

[(1L, datetime.date(2013, 4, 1), 2000L, 4L),
 (1L, datetime.date(2013, 7, 1), 1700L, 7L),
 (3L, datetime.date(2013, 1, 1), 5000L, 10L),
 (3L, datetime.date(2013, 2, 1), 6000L, 11L)]

In [15]:
%%sql 
CREATE VIEW Last_two_month
as  
      SELECT *
      FROM Without_last_month a
      WHERE Month = 
                ( 
                  SELECT MAX(Month)
                  FROM Without_last_month b
                  WHERE a.ConsumerID = b.ConsumerID
                )
      UNION 

      SELECT *
      FROM Last_month

0 rows affected.

[]

In [16]:
%%sql
SELECT *
FROM Last_two_month
ORDER BY ConsumerID, Month;

5 rows affected.

[(1L, datetime.date(2013, 7, 1), 1700L, 7L),
 (1L, datetime.date(2013, 10, 1), 3250L, 10L),
 (2L, datetime.date(2013, 2, 1), 3700L, 8L),
 (3L, datetime.date(2013, 2, 1), 6000L, 11L),
 (3L, datetime.date(2013, 5, 1), 7000L, 12L)]